In [1]:
from os import times_result

import numpy as np
import pandas as pd
from pandas import DataFrame

### 替换操作
##### 替换操作可以同步作用于Series和DataFrame中
##### 单值替换
#####

In [2]:
df = DataFrame(data = np.random.randint(0, 100, size=(5,6)))

In [3]:
df.replace(to_replace= 77, value = 'Nine') # 普通替换

      0   1   2   3   4   5
0    80  53  61  57  17  19
1    72  14  72  18  74  78
2  Nine  76  83  13  87  95
3    95  98   5  81  84   9
4    65  52  85  37  87  78

In [4]:
df.replace(to_replace={0: 'eight'}) #字典替换

    0   1   2   3   4   5
0  80  53  61  57  17  19
1  72  14  72  18  74  78
2  77  76  83  13  87  95
3  95  98   5  81  84   9
4  65  52  85  37  87  78

In [5]:
df.replace(to_replace={3:5}, value= 'Nine')

    0   1   2   3   4   5
0  80  53  61  57  17  19
1  72  14  72  18  74  78
2  77  76  83  13  87  95
3  95  98   5  81  84   9
4  65  52  85  37  87  78

In [6]:
df.replace(to_replace={4:77}, value= 'nine') # 将指定列中具体的某一个元素进行替换， to_replace={列索引: 被替换的值}, value = ‘要替换的值’

    0   1   2   3   4   5
0  80  53  61  57  17  19
1  72  14  72  18  74  78
2  77  76  83  13  87  95
3  95  98   5  81  84   9
4  65  52  85  37  87  78

In [7]:
df.replace(to_replace={77: 'seven', 88: 'eight', 0:8})

       0   1   2   3   4   5
0     80  53  61  57  17  19
1     72  14  72  18  74  78
2  seven  76  83  13  87  95
3     95  98   5  81  84   9
4     65  52  85  37  87  78

### 映射操作
#### - 概念： 创建一个映射关系列表，把values元素和一个特定的标签或者字符串绑定（给一个元素值不同的表现形式）
#### - 创建df, 两列分别是姓名和薪资， 然后给起名字取对应的英文名

In [8]:
dic = {
    'name': ['张三', '李四', '王五'],
    'Salary': [15000, 20000, 18000]
}
df = DataFrame(data = dic)
df

  name  Salary
0   张三   15000
1   李四   20000
2   王五   18000

In [9]:
#映射表
dic = {
    '张三': 'tom',
    '李四': 'jack',
    '王五': 'rouse'
}
df['e_name'] = df['name'].map(dic) # 这里的map是Series里的函数,是映射需要的函数
df

  name  Salary e_name
0   张三   15000    tom
1   李四   20000   jack
2   王五   18000  rouse

#### map 除了可以做映射工具,也可以做运算工具

In [10]:
#薪资超过5000的部分, 收取20%的个人所得税, 计算每个人的税后薪资
def after_sal(s):
  return  (s - (s-5000) * 0.2) if s > 5000 else s

df['after_sal'] = df['Salary'].map(after_sal) # 可以将['salary'] 这个Series中的每个元素(薪资)作为参数传递给s
df

  name  Salary e_name  after_sal
0   张三   15000    tom    13000.0
1   李四   20000   jack    17000.0
2   王五   18000  rouse    15400.0

#### 数据的分类处理
##### - 数据分类处理的两个部分
##### - groupby()函数
##### - group 属性查看分组情况

In [11]:
df = DataFrame({'item': ['Apple', 'Orange', 'Banana', 'Orange', 'Banana', 'Apple'],
               'price': [1, 2, 3, 4, 5, 6],
               'color': ['red', 'yellow', 'yellow', 'green', 'green', 'green'],
               'weight': [12, 20, 50, 30, 23, 12]})
df

     item  price   color  weight
0   Apple      1     red      12
1  Orange      2  yellow      20
2  Banana      3  yellow      50
3  Orange      4   green      30
4  Banana      5   green      23
5   Apple      6   green      12

### 分类需要有一个分组的条件

In [12]:
df.groupby(by='item').groups

{'Apple': [0, 5], 'Banana': [2, 4], 'Orange': [1, 3]}

In [13]:
# 计算每一种水果的评价价格
df.groupby(by='item')['price'].mean()

item
Apple     3.5
Banana    4.0
Orange    3.0
Name: price, dtype: float64

In [14]:
dic = df.groupby(by='color')['weight'].sum()

In [15]:
df['mean_w']=df['color'].map(dic)
df

     item  price   color  weight  mean_w
0   Apple      1     red      12      12
1  Orange      2  yellow      20      70
2  Banana      3  yellow      50      70
3  Orange      4   green      30      65
4  Banana      5   green      23      65
5   Apple      6   green      12      65

### 高级数据的聚合
- 使用groupby分组后, 也可以使用transform和apply提供自定义函数来实现更多计算
- transform和apply都可以进行远算

In [16]:
# 自己封装一个函数
def my_mean(s):
    m_sum = 0
    for i in s:
        m_sum += i
    return m_sum/len(s)

df.groupby('item')['price'].transform(my_mean)

0    3.5
1    3.0
2    4.0
3    3.0
4    4.0
5    3.5
Name: price, dtype: float64

In [17]:
df.groupby('item')['price'].apply(my_mean)

item
Apple     3.5
Banana    4.0
Orange    3.0
Name: price, dtype: float64

### 数据的加载
- 读取文件的数据

In [18]:
df = pd.read_csv("./file/f.txt")
df

   0               hello
0  1         who are you
1  2               oh no
2  3  you are fuck a gay
3  4             get out

In [19]:
df.shape

(4, 2)

- 将文件中每一个词作为一个元素放到dataFrame中
- 用header = None 去掉头, 用sep 去掉分隔符

In [20]:
pd.read_csv('./file/f.txt', header=None, sep=',')

   0                   1
0  0               hello
1  1         who are you
2  2               oh no
3  3  you are fuck a gay
4  4             get out

## 透视表
- 透视表是一种可以对数据动态分布并分类汇总的表格形式
- 在pands中他被称作 pivot_table

In [21]:
df = pd.read_csv('./file/透视表_篮球赛.csv', encoding='utf-8')
df

,对手,胜负,主客场,命中,投篮数,投篮命中率,3分命中率,篮板,助攻,失误,场均抢断,场均盖帽,命中.1,得分
0,犹他 爵士,胜,客,6.9,10.5,0.527143,0.5000,36.5,11.57,47.0,22.5,14.6,6.9,19.2
1,波士顿 凯尔特人,胜,客,9.0,10.6,0.541429,0.5000,33.3,11.55,43.8,27.2,13.0,9.0,19.4
2,犹他 爵士,胜,主,8.7,9.9,0.528571,0.4875,36.0,11.21,45.9,26.2,13.7,8.7,19.3
3,密尔沃基 雄鹿,负,客,7.7,10.7,0.515714,0.5250,36.4,11.21,47.1,22.9,13.9,7.7,17.7
4,波士顿 凯尔特人,胜,客,8.4,9.4,0.501429,0.5000,36.1,11.18,45.5,24.6,15.3,8.4,20.3
5,孟菲斯 灰熊,胜,主,10.2,13.5,0.491429,0.5125,34.8,11.17,48.3,25.1,13.4,10.2,19.2
6,亚特兰大 老鹰,负,主,6.6,10.5,0.538571,0.4750,35.0,11.13,45.5,23.8,12.2,6.6,17.8
7,休斯顿 火箭,负,客,7.8,8.9,0.552857,0.4500,34.0,11.13,42.9,23.8,13.2,7.8,18.8
8,费城 76人,胜,客,7.0,9.4,0.495714,0.4625,36.1,11.07,45.4,25.6,14.1,7.0,19.7
9,休斯顿 火箭,胜,主,7.9,11.1,0.504286,0.4750,34.9,11.07,46.0,28.0,13.1,7.9,17.7
10,波士顿 凯尔特人,胜,主,9.5,9.6,0.518571,0.4750,36.3,11.02,45.9,28.1,15.9,9.5,20.4
11,犹他 爵士,胜,主,6.9,10.4,0.494286,0.5125,33.9,10.95,44.3,22.7,14.4,6.9,19.4
12,费城 76人,胜,主,7.6,10.2,0.508571,0.4750,33.5,10.88,43.7,22.6,13.5,7.6,19.8
13,波士顿 凯尔特人,胜,主,8.7,12.6,0.482857,0.4875,33.0,10.88,45.6,24.2,15.4,8.7,22.0
14,犹他 爵士,负,主,7.0,10.9,0.537143,0.5000,33.9,10.84,44.8,25.5,14.5,7.0,19.9
15,犹他 爵士,负,主,9.3,13.1,0.492857,0.4500,31.8,10.83,44.9,22.0,12.6,9.3,19.8
16,印第安纳 步行者,负,主,7.0,10.5,0.467143,0.5000,34.0,10.81,44.5,24.0,14.1,7.0,20.0
17,休斯顿 火箭,胜,主,7.3,10.1,0.505714,0.4875,35.3,10.78,45.4,25.4,14.9,7.3,16.8
18,波士顿 凯尔特人,胜,主,7.5,10.9,0.480000,0.5000,34.9,10.77,45.8,22.8,14.0,7.5,18.8
19,华盛顿 奇才,胜,客,6.5,9.1,0.462857,0.4875,35.1,10.75,44.2,23.9,13.4,6.5,19.1
20,休斯顿 火箭,负,客,7.5,9.8,0.490000,0.5000,33.1,10.75,42.9,22.7,17.1,7.5,20.6
21,费城 76人,负,主,7.9,8.4,0.507143,0.4750,33.8,10.74,42.2,22.9,12.5,7.9,19.1
22,丹佛 掘金,负,主,7.3,8.4,0.487143,0.4625,34.3,10.63,42.8,25.9,13.9,7.3,19.2
23,休斯顿 火箭,负,主,7.1,9.5,0.475714,0.4875,34.1,10.56,43.6,23.9,12.4,7.1,19.8
24,休斯顿 火箭,负,客,7.4,12.2,0.477143,0.4875,34.6,10.53,46.7,24.5,14.7,7.4,19.3
25,休斯顿 火箭,胜,主,7.8,8.8,0.510000,0.5000,35.0,10.51,43.8,22.8,14.7,7.8,18.0
26,费城 76人,胜,主,7.0,10.8,0.510000,0.5000,34.2,10.40,45.0,20.9,13.4,7.0,19.0
27,休斯顿 火箭,负,主,6.8,9.6,0.462857,0.5000,34.3,10.17,43.9,22.0,14.9,6.8,20.0
28,波士顿 凯尔特人,负,客,8.3,10.4,0.444286,0.4750,32.6,10.09,43.0,21.9,15.3,8.3,20.7
29,休斯顿 火箭,负,客,7.3,10.2,0.442857,0.4750,36.0,9.97,46.2,20.5,13.7,7.3,18.0

### pivot_table 有四个重要的参数index, values, columns, aggfunc
- index参数, 分类汇总的条件
- 每个pivot_table 必须拥有一个index. 如果想查看每个对阵队伍的得分, 则需要对每个队进行分类计算其对应的各类得分的平均值
- 想要看对阵同一对手在不同客场下的数据, 分类的条件为对手的主客场
- values参数:需要对相应的数据进行筛选

In [22]:
# 如果获取 在主客场和不同胜负下的得分, 篮板与助攻三项数据
df.pivot_table(index = ['主客场', '胜负'], values= ['得分', '篮板', '助攻'])

               助攻         得分         篮板
主客场 胜负
主   胜   10.876364  19.127273  34.709091
    负   10.713750  19.450000  33.900000
客   胜   11.224000  19.540000  35.420000
    负   10.613333  19.183333  34.450000

- aggfunc 参数: 设置对数据时进行的函数操作, 如果没有设置, 默认 aggfunc = 'mean',计算平均值

In [23]:
# 如果还想获得主客场不同胜负情况下的总得分,总篮板,总助攻
df.pivot_table(index= ['主客场', '胜负'], values= ['得分', '篮板', '助攻'], aggfunc='sum')

            助攻     得分     篮板
主客场 胜负
主   胜   119.64  210.4  381.8
    负    85.71  155.6  271.2
客   胜    56.12   97.7  177.1
    负    63.68  115.1  206.7

- columns 设置层次的字段
- 对values字段进行分类

In [24]:
# 获取所有队伍的主客场的总得分
df.pivot_table(index = '主客场', values = '得分', aggfunc='sum')

        得分
主客场
主    366.0
客    212.8

In [25]:
# 获取所有队伍的主客场的中得分(在总得分的基础上进行对手分类)
df.pivot_table(index='主客场', values= '得分', aggfunc='sum', columns= '对手', fill_value=0)

对手,丹佛 掘金,亚特兰大 老鹰,休斯顿 火箭,华盛顿 奇才,印第安纳 步行者,孟菲斯 灰熊,密尔沃基 雄鹿,波士顿 凯尔特人,犹他 爵士,费城 76人
主客场,,,,,,,,,,
主,19.2,17.8,92.3,0.0,20.0,19.2,0.0,61.2,78.4,57.9
客,0.0,0.0,76.7,19.1,0.0,0.0,17.7,60.4,19.2,19.7

In [26]:
df = DataFrame({'sex': ['man', 'woman', 'man', 'man', 'woman', 'woman', 'woman', 'man', 'woman'],
                'age': [10, 13, 18, 22, 21, 15, 19, 33, 40],
                'smoke': [True, False, False, True, False, True, True, True, False],
                'height': [145, 154, 177, 168, 170, 183, 165, 175, 156]
            })
df

     sex  age  smoke  height
0    man   10   True     145
1  woman   13  False     154
2    man   18  False     177
3    man   22   True     168
4  woman   21  False     170
5  woman   15   True     183
6  woman   19   True     165
7    man   33   True     175
8  woman   40  False     156

In [27]:
# 每个性别的抽烟人数
pd.crosstab(df.smoke, df.sex)

sex    man  woman
smoke
False    1      3
True     3      2

In [28]:
# 求各年龄段抽烟的情况
pd.crosstab(df.smoke, df.age)

age    10  13  15  18  19  21  22  33  40
smoke
False   0   1   0   1   0   1   0   0   1
True    1   0   1   0   1   0   1   1   0

### 为什么要进行数据清洗
- 清洗什么样的数据
- NaN和None的数据
- 空值
- 重复的数据
- 异常的数据

In [29]:
type(np.nan)

float

In [30]:
type(None)

NoneType

### 在数据分析中,我们需要浮点类型的空,而不是对象类的空
- 因为在数据分析中经常会使用某些形式的运算来处理原始数据, 所以我们要用NaN的形式,这样才不会干扰或终止运算
- 因为NaN是可以参与运算的, 但是None不能参加运算

In [31]:
df = DataFrame(data = np.random.randint(0, 100, size=(8,6)))
df

    0   1   2   3   4   5
0  42  24   2  41  29  74
1  53  86  75  14  28  61
2  13  31  79  25  55  65
3   7  11   6  32   9  22
4  82   7  28  10  82  64
5  21  78  81  57  85  71
6  58  64   9  87   3   4
7  33  94  39  56  16  38

In [32]:
df.iloc[2, 3] = None
df.iloc[4, 5] = None
df.iloc[5, 3] = None
df

    0   1   2     3   4     5
0  42  24   2  41.0  29  74.0
1  53  86  75  14.0  28  61.0
2  13  31  79   NaN  55  65.0
3   7  11   6  32.0   9  22.0
4  82   7  28  10.0  82   NaN
5  21  78  81   NaN  85  71.0
6  58  64   9  87.0   3   4.0
7  33  94  39  56.0  16  38.0

In [33]:
df.isnull()

       0      1      2      3      4      5
0  False  False  False  False  False  False
1  False  False  False  False  False  False
2  False  False  False   True  False  False
3  False  False  False  False  False  False
4  False  False  False  False  False   True
5  False  False  False   True  False  False
6  False  False  False  False  False  False
7  False  False  False  False  False  False

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       8 non-null      int32
 1   1       8 non-null      int32
 2   2       8 non-null      int32
 3   3       6 non-null      float64
 4   4       8 non-null      int32
 5   5       7 non-null      float64
dtypes: float64(2), int32(4)
memory usage: 388.0 bytes

In [35]:
df.info

<bound method DataFrame.info of     0   1   2     3   4     5
0  42  24   2  41.0  29  74.0
1  53  86  75  14.0  28  61.0
2  13  31  79   NaN  55  65.0
3   7  11   6  32.0   9  22.0
4  82   7  28  10.0  82   NaN
5  21  78  81   NaN  85  71.0
6  58  64   9  87.0   3   4.0
7  33  94  39  56.0  16  38.0>

In [36]:
# 找出哪些行中存在True
df.isnull().any(axis = 1) # any用于检测行或者列中是否存在True

0    False
1    False
2     True
3    False
4     True
5     True
6    False
7    False
dtype: bool

In [37]:
df.isnull().any(axis = 0)

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [38]:
# 将上面的 bool 型作为数据的索引
df.loc[df.isnull().any(axis = 1)]

    0   1   2     3   4     5
2  13  31  79   NaN  55  65.0
4  82   7  28  10.0  82   NaN
5  21  78  81   NaN  85  71.0

In [39]:
# 将带空的行删除
drop_index = df.loc[df.isnull().any(axis = 1)].index #将要删除的行进行索引
drop_index
df.drop(labels=drop_index, axis= 0) #将带有空值的行进行删除

    0   1   2     3   4     5
0  42  24   2  41.0  29  74.0
1  53  86  75  14.0  28  61.0
3   7  11   6  32.0   9  22.0
6  58  64   9  87.0   3   4.0
7  33  94  39  56.0  16  38.0

In [40]:
df.notnull().all(axis=1)

0     True
1     True
2    False
3     True
4    False
5    False
6     True
7     True
dtype: bool

In [41]:
df.fillna(method = 'ffill', axis=0) # 用前一行数据填充

C:\Users\dongz\AppData\Local\Temp\ipykernel_25620\2680043387.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'ffill', axis=0) # 用前一行数据填充

    0   1   2     3   4     5
0  42  24   2  41.0  29  74.0
1  53  86  75  14.0  28  61.0
2  13  31  79  14.0  55  65.0
3   7  11   6  32.0   9  22.0
4  82   7  28  10.0  82  22.0
5  21  78  81  10.0  85  71.0
6  58  64   9  87.0   3   4.0
7  33  94  39  56.0  16  38.0

In [42]:
df.bfill(axis = 0)

    0   1   2     3   4     5
0  42  24   2  41.0  29  74.0
1  53  86  75  14.0  28  61.0
2  13  31  79  32.0  55  65.0
3   7  11   6  32.0   9  22.0
4  82   7  28  10.0  82  71.0
5  21  78  81  87.0  85  71.0
6  58  64   9  87.0   3   4.0
7  33  94  39  56.0  16  38.0

### 清洗重复的数据

In [43]:
df = DataFrame(data = np.random.randint(1, 100, size = (8, 5)))
#
df.iloc[2] = [0, 0, 0, 0, 0]
df.iloc[3] = [0, 0, 0, 0, 0]
df.iloc[5] = [0, 0, 0, 0, 0]
df

    0   1   2   3   4
0  34  18  37  85  10
1  64  50  22  96  15
2   0   0   0   0   0
3   0   0   0   0   0
4  43  82  56  64  32
5   0   0   0   0   0
6  90   4  76  43  10
7  74  60   9  67  35

#### 使用 drop_duplicates 来处理重复的数据

In [44]:
df.drop_duplicates(keep = False)

    0   1   2   3   4
0  34  18  37  85  10
1  64  50  22  96  15
4  43  82  56  64  32
6  90   4  76  43  10
7  74  60   9  67  35

### 清洗异常的数据
#### 自定义一个 1000 行 3列(A， B， C) 取值范围都在 [0, 1]的数据
#### 将C列值中 大于其两倍标准差的异常值进行清洗

In [45]:
df = DataFrame(data = np.random.random(size=(1000, 3)), columns= ['A', 'B', 'C'])
# 判断异常值的条件
twice_std = df['C'].std()*2
df['C']>twice_std
~(df['C']>twice_std) # False 为异常值
df.loc[(df['C']>twice_std)]

            A         B         C
1    0.488736  0.875521  0.936067
8    0.000902  0.082226  0.704160
16   0.505900  0.696125  0.660209
18   0.337504  0.874361  0.659027
19   0.201519  0.510235  0.574421
..        ...       ...       ...
991  0.636094  0.902262  0.857360
995  0.669528  0.023130  0.875419
996  0.122381  0.785351  0.677750
998  0.833037  0.429394  0.841884
999  0.139456  0.192079  0.704311

[446 rows x 3 columns]